Repository: RobertoAbad505/HackerKids
Catalog: HackerKids/Localizable.xcstrings
Source language: en
Languages: es_419

source: ⏱️ Your time:
es_419: ⏱️ Tu tiempo:

source: ⚖️Weight
es_419: ⚖️Peso

source: ⚛️Species
es_419: ⚛️Especie

source: ✅ You won!! 🏆
es_419: ✅ Ganaste!! 🏆

source: ✅ Start!
es_419: ✅ Iniciar!

# ✅Salir
source: ✅Exit
es_419: ✅Salir

# ❌Cancelar
source: ❌Cancel
es_419: ❌Cancelar

source: 🌐 Longitude
es_419: 🌐 Longitud

# 🍎💼 iOS Portafolio
source: 🍎💼 iOS Portfolio
es_419: 🍎💼 iOS Portafolio

# 🍎📱 Apps y prototipos
source: 🍎📱 Apps and prototypes
es_419: 🍎📱 Apps y prototipos

source: 📍GPS Coordinates
es_419: 📍Coordenadas GPS

source: 📏Height
es_419: 📏Altura

source: 📲 About me . . .
es_419: 📲 Sobre mi . . .

source: 📲 Leave a message! ;)
es_419: 📲 Dejame un mensaje! ;)

# 📲 Portafolio
source: 📲 Portfolio
es_419: 📲 Portafolio

# 🔎👀 Inspeccionar JSON response
source: 🔎👀 Inspect JSON response
es_419: 🔎👀 Inspeccionar JSON response

source: 🕹️ Interact with this view!
es_419: 🕹️ Interactua con esta vista!

source: 🗺️ Weather Map
es_419: 🗺️ Mapa del clima

# exitConfirmationTitle
source: Do you want to exit the game?
es_419: ¿Deseas salir del juego?

source: Gender: %@
es_419: Genero: %@

# Más de mis proyectos en GitHub:
source: More of my projects on GitHub:
es_419: Más de mis proyectos en GitHub:

source: New game!
es_419: Nuevo juego!

# portfolio.pokemon.description
source: A modern prototype demonstrating list rendering using LazyLoad, reusable components, detail navigation and more features using a public API.
es_419: Un prototipo moderno haciendo list rendering usando LazyLoad, componentes reusables, navegacion por detalles y más funcionalidades usando una API publica.

# portfolio.rickAndMorty.description
source: Display a modern grid built with reusable components by fetching data from a public API. Built with MVVM architecture, infinite scrolling, pagination and more.
es_419: Muestra un grid moderno hecho con componentes reusables y modelados por data obtenida desde una API. Desarrollado con arquitectura MVVM, scroll infinito y paginación.

# portfolio.soupgame.description
source: A word search game built with SwiftUI. Find all the words as quickly as you can to win the challenge!
es_419: Un juego de sopa de letras hecho con SwiftUI. Encuentra todas las palabras lo más rápido que puedas para ganar el reto.

# portfolio.weather.description
source: Get real-time weather updates based on your current location. Uses GPS to display current conditions, forecasts, and more.
es_419: Consulta el clima en tiempo real usando tu ubicación actual. Usa el GPS para mostrar las condiciones actuales, el pronóstico y más.

# portfolioDescriptionKey
source: A curated selection of modules I've personally developed using SwiftUI. These prototypes showcase various techniques, custom components, API integration, HTTP requests, interface design, and more.
es_419: Una colección de módulos que he desarrollado personalmente con SwiftUI. Estos prototipos incluyen diversas técnicas, componentes personalizados, integración con APIs, llamadas HTTP, diseño de interfaces y mucho más.

# settings.go.label
source: Go to settings
es_419: Ir a configuración

source: Software Engineer with 7+ years of experience in the tech industry, collaborating across different sectors and business complexities. Specialized in developing and enhancing iOS applications, with strong expertise in software architecture, performance optimization, and accessibility. I have had the opportunity to work with companies in both Mexico and the United States, including my last two-year project as a Senior iOS Engineer for Wells Fargo, contributing to large-scale digital banking solutions. Currently open to new opportunities where to collaborate and keep learning.
es_419: Ingeniero de software con más de 7 años de experiencia en la industria tecnológica, colaborando en distintos sectores y niveles de complejidad de negocio. Especializado en el desarrollo y mejora de aplicaciones iOS, con sólidos conocimientos en arquitectura de software, optimización de rendimiento y accesibilidad. He tenido la oportunidad de trabajar con empresas en México y Estados Unidos, destacando un proyecto de dos años como Senior iOS Engineer para Wells Fargo, donde contribuí al desarrollo de soluciones bancarias digitales a gran escala. Actualmente abierto a nuevas oportunidades donde pueda seguir construyendo productos tecnológicos y compartiendo mis conocimientos.

# startview.portfolio.description
source: A curated selection of modules I've personally developed using SwiftUI. These prototypes showcase various techniques, custom components, API integration, HTTP requests, interface design, and more.
es_419: Una muestra de modelos y ejemplos que he desarrollado personalmente con SwiftUI. En estos prototipos encontrarás distintas técnicas, componentes personalizados, integración con APIs, llamadas HTTP, diseño de interfaces y más.

# weather.alert.weather.permision.message
source: Please enable localization permission for this app from app settings to use this feature.
es_419: Por favor activa la ubicación en configuración para usar esta funcionalidad.

# weather.alert.weather.permision.title
source: Location permission was denied
es_419: Permiso de ubicación denegado.
